ninety_nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "Steve is a cool cat!"], ["updated_at", "2018-09-11 23:13:58.397132"], ["id", 2]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)